КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/КонтурЛогистика_Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_Партнеры</name>
  <attributes>
    <name>КодПартнераКонтур</name>
    <comment>Идентификатор партнера в сервисах ЭДО Контура</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭПДЭлПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Медик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОрганизацииДиадок</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
    <attributes>
      <name>ГО</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПВ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГП</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Диспетчер</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Медик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Техник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>boxId</name>
      <comment>ящик диадок (на случай если роуминг или несколько провайдеров)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Настройки</types>
        <types>CatalogRef.КонтурЛогистика_НастройкиПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Обработчики</name>
    <attributes>
      <name>Событие</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СобытияОбработчиковПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстОбработкиПослеЗаполнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПунктыМаршрута</name>
    <attributes>
      <name>Название</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GLN</name>
      <comment>необязательно, (Global Location Number) — глобальный идентификационный номер. Он применяется для распознавания организаций, их частей и объектов: складов, магазинов, производств, автомобилей. GLN — международный код</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>13</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИндекс</name>
      <comment>(варинат 2) Индекс - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКодРегион</name>
      <comment>(вариант 2) Код региона - обязателен при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресИнфКодСтраны</name>
      <comment>(вариант 1) Страна - обязательна при указании адреса простым текстом</comment>
      <type>
        <types>CatalogRef.КонтурЛогистика_СтраныМира</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресГород</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресНаселПункт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресУлица</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресРайон</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресДом</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКорпус</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресКварт</name>
      <comment>необязателен, используется при указании адреса через значения полей</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отправление</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:отправления</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прибытие</name>
      <comment>Признак, что Может выступать в этой базе данных в качестве точки:прибытия</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_ПроизвольныеДанные/КонтурЛогистика_ПроизвольныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_ПроизвольныеДанные</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Реквизит1</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Из какого объекта произошла конвертация</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаКонвертацииРС</name>
    <comment>Какая НКРС использовалась при синх. в 1С</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_НастройкиКонвертацииРегистровСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияССервисом</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизацияСОбъектом1С</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыСинхронизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОрганизацияДиадок</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез1</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез2</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез2</comment>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПоказанийТоплива</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Разрез3</name>
    <comment>Состав типо должен соответствовать Спр.НКРС.ОтборРазрез3</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_Партнеры/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОпределитьПартнераОрганизацииДиадок(ОрганизацияДиадок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_ПартнерыОрганизацииДиадок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_Партнеры.ОрганизацииДиадок КАК КонтурЛогистика_ПартнерыОрганизацииДиадок
	|ГДЕ
	|	КонтурЛогистика_ПартнерыОрганизацииДиадок.Организация = &Организация
	|	И НЕ КонтурЛогистика_ПартнерыОрганизацииДиадок.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация",ОрганизацияДиадок);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.КонтурЛогистика_Партнеры.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

Функция ЗначениеНастройки(ПартнерСсылка, Знач НастройкаПартнераИлиОбщая) Экспорт 
	
	Если ТипЗнч(НастройкаПартнераИлиОбщая) = Тип("Строка") Тогда
		
		// по имени настройки поищем сначала в партнере а потом общую
		
		НастройкаПартнераИлиОбщая = Справочники.КонтурЛогистика_НастройкиПартнеров.ПолучитьСсылкуПоИмениПредопределенного(НастройкаПартнераИлиОбщая);
		Если Не ЗначениеЗаполнено(НастройкаПартнераИлиОбщая) Тогда 
			НастройкаПартнераИлиОбщая = Справочники.КонтурЛогистика_Настройки.ПолучитьСсылкуПоИмениПредопределенного(НастройкаПартнераИлиОбщая);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НастройкаПартнераИлиОбщая) Тогда 
			ВызватьИсключение "Не существует настройки с именем " + НастройкаПартнераИлиОбщая + " ни в справочнике настроек партнера, ни в справочнике общих настроек";
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_Партнеры.Значение КАК ЗначениеНастройки
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Партнеры.Настройки КАК КонтурЛогистика_Партнеры
	               |ГДЕ
	               |	КонтурЛогистика_Партнеры.Ссылка = &Ссылка
	               |	И КонтурЛогистика_Партнеры.Настройка = &Настройка
	               |	И НЕ КонтурЛогистика_Партнеры.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", ПартнерСсылка);
	Запрос.УстановитьПараметр("Настройка", НастройкаПартнераИлиОбщая);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ЗначениеНастройки;
	Иначе
		Возврат НастройкаПартнераИлиОбщая.Значение;
	КонецЕсли;
	
КонецФункции

// тех у которых есть КодПартнераКонтур
Функция МассивСинхронизируемыхПартнеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КонтурЛогистика_Партнеры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КонтурЛогистика_Партнеры КАК КонтурЛогистика_Партнеры
	|ГДЕ
	|	НЕ КонтурЛогистика_Партнеры.ПометкаУдаления
	|	И КонтурЛогистика_Партнеры.КодПартнераКонтур <> """"";
	
	Результат = Запрос.Выполнить();
	МассивПартнеров = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");	
	
	Возврат МассивПартнеров;
	
КонецФункции

Функция ДобавленныеПартнеры() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	КонтурЛогистика_Партнеры.КодПартнераКонтур КАК КодПартнераКонтур
	               |ИЗ
	               |	Справочник.КонтурЛогистика_Партнеры КАК КонтурЛогистика_Партнеры
	               |ГДЕ
	               |	НЕ КонтурЛогистика_Партнеры.ПометкаУдаления
	               |	И КонтурЛогистика_Партнеры.КодПартнераКонтур <> """"";
	
	Результат = Запрос.Выполнить();
	МассивКодовПартнеров = Результат.Выгрузить().ВыгрузитьКолонку("КодПартнераКонтур");	
	
	Возврат МассивКодовПартнеров;

КонецФункции

// Возвращает правила торговой сети из кэша требований партнеров по коду PARTIN.
//
// Параметры:
//  КодПартнераКонтур - Строка - код сети (net_code)
//
// Возвращаемое значение:
//  Структура, Неопределено - элемент networks_settings (net_code, requirements)
//                            или Неопределено, если код пустой / кэш пуст / сеть не найдена
//
Функция ПравилаПартнера(КодПартнераКонтур) Экспорт
	
	КодСети = СокрЛП(КодПартнераКонтур);
	
	Если Не ЗначениеЗаполнено(КодСети) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеТребований = ДанныеТребованийПартнеровИзРегистра();
	
	Если ДанныеТребований = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ДанныеТребований.Свойство("networks_settings")
		Или ТипЗнч(ДанныеТребований.networks_settings) <> Тип("Массив") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Для Каждого УзелСети Из ДанныеТребований.networks_settings Цикл
		
		Если ТипЗнч(УзелСети) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		КодУзла = "";
		Если Не УзелСети.Свойство("net_code", КодУзла) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СокрЛП(КодУзла) = КодСети Тогда
			Возврат УзелСети;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция ДанныеТребованийПартнеровИзРегистра()
	
	ТипДанных = РегистрыСведений.КонтурЛогистика_ПроизвольныеДанные.ТипыДанных().ТребованияПартнеров;
	ПустаяОрганизация = Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка();
	ПустойРазрез2 = Перечисления.КонтурЛогистика_ТипыПоказанийТоплива.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОрганизацияДиадок", ПустаяОрганизация);
	Запрос.УстановитьПараметр("ТипДанных", ТипДанных);
	Запрос.УстановитьПараметр("Разрез1", "");
	Запрос.УстановитьПараметр("Разрез2", ПустойРазрез2);
	Запрос.УстановитьПараметр("Разрез3", "");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтурЛогистика_ПроизвольныеДанные.ДанныеХранилище КАК ДанныеХранилище
	|ИЗ
	|	РегистрСведений.КонтурЛогистика_ПроизвольныеДанные КАК КонтурЛогистика_ПроизвольныеДанные
	|ГДЕ
	|	КонтурЛогистика_ПроизвольныеДанные.ОрганизацияДиадок = &ОрганизацияДиадок
	|	И КонтурЛогистика_ПроизвольныеДанные.ТипДанных = &ТипДанных
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез1 = &Разрез1
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез2 = &Разрез2
	|	И КонтурЛогистика_ПроизвольныеДанные.Разрез3 = &Разрез3";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если Не ЗначениеЗаполнено(Выборка.ДанныеХранилище) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Данные = Выборка.ДанныеХранилище.Получить();
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#КонецЕсли
